import { WorldMap } from '../components/WorldMap';

let BrokersPage = () => {
  return (
    <div>
      <div className="pageName pageName--1">
        <div className="flex flex-col gap-2 text-center">
          <h3 className="hero__subtitle">Flower Fracht Karaganda</h3>
          <h2 className="hero__title title--underline">Брокерам</h2>
        </div>
      </div>

      <section className="section3 px-4 lg:px-wrap xl:pt-40">
        <h2 className="section__title mb-10 text-center lg:mx-auto lg:max-w-xl xl:mb-20 xl:max-w-4xl">
          Помогаем брокерам из любых стран с доставкой цветов по всему СНГ
        </h2>

        <div className="lg:flex lg:justify-between lg:gap-16 xl:items-start">
          <Illustration className="lg:flex-1 xl:flex-[0.4]" />
          <ol className="flex flex-col gap-2.5 lg:flex-[0.7] xl:grid xl:flex-[0.5] xl:grid-cols-2 xl:grid-rows-2">
            {[
              { title: '1 шаг', text: 'Клиент обращается/работает с брокером' },
              { title: '2 шаг', text: 'Клиент обращается/работает с брокером' },
              { title: '3 шаг', text: 'Клиент обращается/работает с брокером' },
              { title: '4 шаг', text: 'Клиент обращается/работает с брокером' },
            ].map((item) => (
              <li className="card card--decor card--count" key={item.title}>
                <h2 className="card__title mb-2.5 xl:mt-4">{item.title}</h2>
                <p className="card__description">{item.text}</p>
              </li>
            ))}
          </ol>
        </div>
      </section>
    </div>
  );
};

let Illustration = (props: any) => (
  <svg fill="none" viewBox="0 0 244 233" {...props}>
    <WorldMap width={180} height={100} x={40} y={75} />
    <g>
      <animateTransform
        type="rotate"
        attributeName="transform"
        from="0 129 120"
        to="360 129 120"
        dur="6s"
        repeatCount="indefinite"
      />
      <circle cx="129" cy="120" r="111" strokeDasharray="1" className="stroke-navy-600" />
      <path
        fill="#227CE4"
        stroke="#227CE4"
        d="M63.58 30.77c.02.04.02.14 0 .2l-1.17 3.38c-.04.13-.21.22-.34.2a.25.25 0 0 1-.17-.32l1.12-3.15-3.3-.8a.25.25 0 0 1-.16-.3c.04-.13.21-.23.34-.2l3.55.86c.06.01.1.1.13.13Zm177.32 83.59a.3.3 0 0 1-.2-.05l-2.98-1.99c-.11-.07-.16-.26-.1-.38a.25.25 0 0 1 .35-.08l2.77 1.88 1.6-2.97a.25.25 0 0 1 .35-.08c.11.07.16.26.1.38l-1.74 3.2c-.03.06-.12.08-.16.1ZM85.25 221.43a.41.41 0 0 1 .15-.14l3.2-1.62c.11-.06.3 0 .37.1.07.12.02.3-.1.35l-3 1.48 1.8 2.86c.08.11.03.28-.1.34-.1.06-.3.01-.37-.1l-1.95-3.08c-.03-.06 0-.14 0-.19Z"
      />
    </g>
    <ellipse cx={20.35} cy={120.85} fill="#23303F" rx={20.35} ry={20.32} />
    <path
      stroke="#557AA1"
      strokeOpacity={0.3}
      d="M40.2 120.85a19.84 19.84 0 0 1-19.85 19.82A19.84 19.84 0 0 1 .5 120.85a19.84 19.84 0 0 1 19.85-19.82 19.84 19.84 0 0 1 19.86 19.82Z"
    />
    <path
      fill="#9FCCFF"
      d="M20.59 128.93c-.3 0-.6-.1-.8-.3l-1.34-1.2c-.4-.34-.54-.83-.4-1.33l1.3-4.01c.05 0 .15-.05.25-.1.2-.05.4-.15.54-.3l1.05.05c.1.1.24.2.44.25l.3.15 1.24 3.96c.15.5 0 1-.4 1.34l-1.34 1.19c-.24.2-.54.3-.84.3Zm-2.09-2.63c-.1.3 0 .6.25.8l1.34 1.18c.15.1.3.2.5.2s.35-.05.5-.2l1.34-1.19c.24-.2.3-.5.24-.8l-1.29-4H19.8l-1.3 4Z"
    />
    <path
      fill="#F3F3F3"
      d="M16.32 131a2.96 2.96 0 0 1-2.93-2.92v-4.21c0-2.97 2.83-4.11 4.07-4.51l.45-.15-.35-.3a4.52 4.52 0 0 1-1.34-5.15 4.58 4.58 0 0 1 4.37-3.07 4.65 4.65 0 0 1 4.67 4.21v1a4.66 4.66 0 0 1-1.6 3.01l-.34.25.45.1c2.53.7 4.02 2.38 4.02 4.46v4.31a2.93 2.93 0 0 1-2.93 2.93h-8.54v.05Zm2.18-11.4c-1.39.3-4.61 1.3-4.61 4.27v4.21c0 1.34 1.09 2.43 2.43 2.43h8.49a2.43 2.43 0 0 0 2.43-2.43v-4.3c0-2.09-1.69-3.68-4.52-4.17h-.2l-.1.1-.49 1.88h-.1c-.15-.05-.25-.15-.35-.2l.4-1.48-.4.1c-.3.04-.6.1-.89.1-.3 0-.6-.06-.9-.1l-.4-.1.4 1.58c-.04.05-.14.05-.3.1-.04 0-.14.05-.19.05l-.55-2.08-.15.05Zm2.09-8.37a4.08 4.08 0 0 0-4.17 4.17 4.2 4.2 0 0 0 4.17 4.2 4.2 4.2 0 0 0 4.17-4.16 4.09 4.09 0 0 0-4.17-4.2Z"
    />
    <ellipse cx={166.05} cy={20.32} fill="#23303F" rx={20.35} ry={20.32} />
    <path
      stroke="#557AA1"
      strokeOpacity={0.3}
      d="M185.9 20.32a19.84 19.84 0 0 1-19.85 19.82 19.84 19.84 0 0 1-19.86-19.82A19.84 19.84 0 0 1 166.06.5a19.84 19.84 0 0 1 19.85 19.82Z"
    />
    <path
      fill="#F3F3F3"
      d="M157.19 30.48c-.15 0-.25-.1-.25-.24V10.4c0-.14.1-.24.25-.24h11c.14 0 .24.1.24.24v8.52h6.35c.14 0 .24.1.24.24v10.98c0 .15-.1.24-.24.24h-17.6v.1Zm11.29-.53h6.1V19.5h-6.1v10.45Zm-5.77-3.3c.15 0 .24.1.24.25v3.05h5V10.69h-10.47v19.26h4.99V26.9c0-.15.1-.24.24-.24Z"
    />
    <path
      fill="#9FCCFF"
      d="M161.6 19.7a.49.49 0 0 1-.49-.5c0-.28.2-.48.49-.48h2.18c.24 0 .48.2.48.49s-.2.48-.48.48h-2.18Zm0-4.41a.49.49 0 0 1-.49-.49c0-.29.2-.48.49-.48h2.18c.24 0 .48.2.48.48 0 .3-.2.49-.48.49h-2.18Z"
    />
    <ellipse cx={205.69} cy={197.85} fill="#23303F" rx={20.35} ry={20.32} />
    <path
      stroke="#557AA1"
      strokeOpacity={0.3}
      d="M225.54 197.85a19.84 19.84 0 0 1-19.85 19.82 19.84 19.84 0 0 1-19.86-19.82 19.84 19.84 0 0 1 19.86-19.82 19.84 19.84 0 0 1 19.85 19.82Z"
    />
    <path
      fill="#F3F3F3"
      d="M201.65 208a2.96 2.96 0 0 1-2.93-2.92v-4.21c0-2.97 2.83-4.11 4.07-4.51l.45-.15-.35-.3a4.52 4.52 0 0 1-1.34-5.15 4.58 4.58 0 0 1 4.37-3.07 4.65 4.65 0 0 1 4.67 4.21v1a4.66 4.66 0 0 1-1.59 3.01l-.35.25.45.1c2.53.7 4.02 2.38 4.02 4.46v4.31a2.93 2.93 0 0 1-2.93 2.93h-8.54v.05Zm2.19-11.4c-1.4.3-4.62 1.3-4.62 4.27v4.21c0 1.34 1.1 2.43 2.43 2.43h8.5a2.43 2.43 0 0 0 2.42-2.43v-4.3c0-2.09-1.68-3.68-4.51-4.17h-.2l-.1.1-.5 1.88h-.1c-.15-.05-.24-.15-.34-.2l.4-1.48-.4.1c-.3.04-.6.1-.9.1-.3 0-.6-.06-.9-.1l-.39-.1.4 1.58c-.05.05-.15.05-.3.1-.05 0-.15.05-.2.05l-.54-2.08-.15.05Zm2.08-8.37a4.08 4.08 0 0 0-4.17 4.17 4.2 4.2 0 0 0 4.17 4.2 4.2 4.2 0 0 0 4.17-4.16 4.09 4.09 0 0 0-4.17-4.2Z"
    />
    <path
      fill="#9FCCFF"
      d="M205.92 201.86a.7.7 0 1 0 0-1.39.7.7 0 0 0 0 1.4Zm0 2.48a.7.7 0 1 0 0-1.39.7.7 0 0 0 0 1.39Z"
    />
  </svg>
);

export default BrokersPage;
